БухЭксп/InformationRegisters/CW_РолиСотрудниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_РолиСотрудниковОрганизаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ФизическиеЛица</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РольСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_РолиСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/CommonForms/CW_ФормаВыбораСотрудникаДляРоли/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВозможностьСоздаватьЗаписи = Неопределено;
	
	// ---------------------------------------------------------------------------- 
	
	Параметры.Свойство("РольСотрудника"		 		, РольСотрудника);
	Параметры.Свойство("Организация"		 		, Организация);
	Параметры.Свойство("ОтборПоОрганизации"	 		, ОтборПоОрганизации);
	Параметры.Свойство("ВозможностьСоздаватьЗаписи"	, ВозможностьСоздаватьЗаписи);
	Параметры.Свойство("РежимВыбора"				, РежимВыбора);
	
	ВозможностьСоздаватьЗаписи = ?(ВозможностьСоздаватьЗаписи = Неопределено, Ложь, ВозможностьСоздаватьЗаписи); 
	
	Элементы.Список.РежимВыбора 				= РежимВыбора;
	Элементы.СписокСоздать.Видимость 			= ВозможностьСоздаватьЗаписи;
	Элементы.РолиСотрудниковСоздать.Видимость 	= ВозможностьСоздаватьЗаписи;
	Элементы.ФормаВыборИзФормы.Видимость	 	= Не ВозможностьСоздаватьЗаписи;
	
	Заголовок = ?(РежимВыбора, "Выбор сотрудника", "Роли сотрудников");
	
	ДатаСреза = ТекущаяДата();
	
	_УстановитьПараметрыСписка();	
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _УстановитьПараметрыСписка()
	
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("РольСотрудника"	,	Элементы.РолиСотрудников.ТекущаяСтрока);
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаСреза"		, ?(ОтборПоДате,ДатаСреза,ТекущаяДата()));
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация"		,?(ОтборПоОрганизации,Организация,Неопределено));
	                                                                                                	
	//	Элементы.СписокОрганизация.Видимость = (НЕ ОрганизацияЗаполнена);
	
КонецПроцедуры


&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОтборПоОрганизации = ЗначениеЗаполнено(Организация);
	
	_УстановитьПараметрыСписка();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если РежимВыбора Тогда
		ЭтаФорма.Закрыть(Элементы.Список.ТекущиеДанные.Сотрудник);	
	Иначе
		ОткрытьФормуРедактированияЗаписиРегистра();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	_УстановитьПараметрыСписка();

КонецПроцедуры


&НаКлиенте
Процедура ОтборПоДатеПриИзменении(Элемент)
	
	Если НЕ ОтборПоДате Тогда
		
		ДатаСреза = ТекущаяДата();
		
	КонецЕсли;
	
	_УстановитьПараметрыСписка();

КонецПроцедуры


&НаКлиенте
Процедура ОтборПоОрганизацииПриИзменении(Элемент)
	
	_УстановитьПараметрыСписка();

КонецПроцедуры


&НаКлиенте
Процедура РолиСотрудниковПриАктивизацииСтроки(Элемент)
	
	_УстановитьПараметрыСписка();

КонецПроцедуры

&НаКлиенте
Процедура ВыборИзФормы(Команда)
	
	ЭтаФорма.Закрыть(Элементы.Список.ТекущиеДанные.Сотрудник);	

КонецПроцедуры

&НаКлиенте 
Процедура ПослеЗакрытияФормы(Ответ, ДополнительныеПараметры) Экспорт 

	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(РольСотрудника) Тогда
		Элементы.РолиСотрудников.ТекущаяСтрока = РольСотрудника;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСоздать(Команда)
	
	ПараметрыФормы = новый Структура;
	ПараметрыФормы.Вставить("РольСотрудника", Элементы.РолиСотрудников.ТекущаяСтрока);
	ПараметрыФормы.Вставить("Организация"	, ?(ОтборПоОрганизации, Организация, Неопределено));
	ПараметрыФормы.Вставить("Период"		, ?(ОтборПоДате, ДатаСреза, ТекущаяДата()));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормы", ЭтаФорма);

	ОткрытьФорму("РегистрСведений.CW_РолиСотрудниковОрганизаций.ФормаЗаписи",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокРедактировать(Команда)
	
	ОткрытьФормуРедактированияЗаписиРегистра();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияЗаписиРегистра()
	
	ПараметрыЗаписи = новый Структура;
	ПараметрыЗаписи.Вставить("Период"			, Элементы.Список.ТекущиеДанные.Период);
	ПараметрыЗаписи.Вставить("РольСотрудника"	, Элементы.РолиСотрудников.ТекущаяСтрока);
	ПараметрыЗаписи.Вставить("Сотрудник"		, Элементы.Список.ТекущиеДанные.Сотрудник);
	ПараметрыЗаписи.Вставить("Организация"		, Элементы.Список.ТекущиеДанные.Организация);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормы", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура("Ключ", ПолучитьКлючЗаписи(ПараметрыЗаписи));
	
	ОткрытьФорму("РегистрСведений.CW_РолиСотрудниковОрганизаций.Форма.ФормаЗаписи",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьНаСервере(ПараметрыЗаписи)
	
	Запись = РегистрыСведений.CW_РолиСотрудниковОрганизаций.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, ПараметрыЗаписи);
	Запись.Прочитать();
	Запись.Удалить();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУдалить(Команда)
	
	ПараметрыЗаписи = новый Структура;
	ПараметрыЗаписи.Вставить("Период"			, Элементы.Список.ТекущиеДанные.Период);
	ПараметрыЗаписи.Вставить("РольСотрудника"	, Элементы.РолиСотрудников.ТекущаяСтрока);
	ПараметрыЗаписи.Вставить("Сотрудник"		, Элементы.Список.ТекущиеДанные.Сотрудник);
	ПараметрыЗаписи.Вставить("Организация"		, Элементы.Список.ТекущиеДанные.Организация);
	
	УдалитьЗаписьНаСервере(ПараметрыЗаписи);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючЗаписи(ПараметрыЗаписи)
    Возврат РегистрыСведений.CW_РолиСотрудниковОрганизаций.СоздатьКлючЗаписи(Новый Структура("Период,Сотрудник,РольСотрудника,Организация", ПараметрыЗаписи.Период, ПараметрыЗаписи.Сотрудник, ПараметрыЗаписи.РольСотрудника,  ПараметрыЗаписи.Организация));
КонецФункции
